import React from "react";
const terms = [
  "لا يشترط الشراء للدخول في المسابقة.",
  "تخضع شروط المسابقة للقوانين والأنظمة الجارية في المملكة العربية السعودية.",
  "لا يحق لموظفي الغرف التجارية وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
  "لا يحق لموظفي الشركة المشغلة للنظام وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
  "لا يحق لموظفي وكالة الاعلان والدعاية وعائلاتهم من الدرجة الاولي المشاركة في المسابقات.",
  "لا يحق لموظفي الشركة صاحبة المسابقة وعائلاتهم من الدرجة الاولي المشاركة في المسابقة الخاصة بها.",
  "لا يحق لموظفي المراكز التجارية المشاركة وعائلاتهم من الدرجة الاولي المشاركة في المسابقة الخاصة بها",
  "يجب ان يكون الاسم مطابق للهوية النظامية المعمول بها في المملكة العربية السعودية.",
  "في حال تبين أكثر من حساب لشخص واحد فسوف يتم الغاء جميع الحسابات بلا استثناء بما فيها الحساب الرئيسي وذلك لبيان تحايله علي الأنظمة وسيحرم من جميع الجوائز التي ربحها تحت هذه الحسابات",
  "للمقيمين في المملكة العربية السعودية كتابة الاسم بالكامل باللغة العربية كما هو موجود في الهوية النظامية (الهوية الوطنية, الهويةالخليجية, هوية مقيم, هوية زائر, جواز السفر).",
  "يجب علي جميع الفائزين ان تكون الهوية سارية المفعول عند استلام الجائزة.",
  "تغيير بيانات حساب قام بالمشاركة في مسابقة لم يتم السحب عليها بعد, يحرم صاحبه من الفوز فيها حتي وان فاز.",
  "في حال لم يتطابق اسم الفائز مع الاسم الموجود بالهوية النظامية المعتمدة في المملكة العربية السعودية يتم استبعاده واعادة السحب مرة اخري.",
  "تعبئة الاقرار ببيانات صحيحة حسب الهوية النظامية (الهوية الوطنية, الهوية الخليجية, هوية زائر, جواز السفر) والمرسل من قبل نظام (eCopon) الي جوال الفائز علي شكل رابط.",
  "قراءة (بطاقة استلام جائزة) المنشأة من نظام (eCopon) من قبل الشركة المنظمة للمسابقة يعد اقرارا من قبل الفائز باستلام الجائزة.",
  "يحق لشركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) رفع دعوي تحايل علي الأشخاص الذين قاموا بتعبئة نموذج الاقرار ببيانات غير صحيحة ولا تطابق الهوية النظامية (الهوية الوطنية, الهوية الخليجية, هوية زائر, جوازالسفر).",
  "الدخول في المسابقة يعد موافقة ضمنية لشروطها وأحكامها.",
  "شركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) هي شركة مشغلة لنظام المسابقات فقط, ليس لهاأي صلاحية علي نوع أو كمية الجوائز أو تسليمها أو استبدالها وانما يتم ذلك عن طريق الشركة أوالجهةراعية المسابقة أو المنظمة لها.",
  "شركة الارتباط الذكي لتقنية المعلومات المحدودة (eCopon) هي شركة مشغلة لنظام المسابقات فقط, ليس لها أي علاقة في حال أخل احد الطرفين باي بند من بنود استلام (الفائز) أو تسليم (المنشأة) الجائزة",
  "أبل ليست مسئولة عن أي مسابقة من هذه المسابقات والمتواجة في نظام وتطبيق eCopon, وانه ليس لها اي علاقة باي شكل من الاشكال بهذه المسابقات.",
];

const DetailsTermsAndConditions = () => {
  return (
    <div>
      <ol className="text-right space-y-2 text-shadeGray list-decimal px-4">
        {terms.map((term, i) => {
          return <li key={i}>{term}</li>;
        })}
      </ol>
    </div>
  );
};

export default DetailsTermsAndConditions;
